Repository: chrissharp80/emuqu
Catalog: Emuqu/Help.xcstrings
Source language: en
Languages: ar, da, de, es, fi, fr, is, it, ja, ko, nb, nl, pt_br, ru, sv, zh_hans

source: When you're ready, tap Get Reading. The app analyzes your data and finds the best 5-minute analysis window. The full Recovery Report opens automatically once analysis completes — no extra tap required. If using an H10, device data uploads in the background and silently refines the score if it's better.
ar: عندما تكون مستعدًا، اضغط الحصول على القراءة. يحلّل التطبيق بياناتك ويجد أفضل نافذة تحليل مدتها 5 دقائق. يُفتح تقرير التعافي الكامل تلقائيًا فور اكتمال التحليل — دون ضغطة إضافية. إذا كنت تستخدم H10، تُرفع بيانات الجهاز في الخلفية وتنقّح النتيجة بصمت إن كانت أفضل.
da: Når du er klar, så tryk på Få måling. Appen analyserer dine data og finder det bedste 5-minutters analysevindue. Hele restitutionsrapporten åbner automatisk, når analysen er færdig — intet ekstra tryk nødvendigt. Bruger du en H10, uploades enhedens data i baggrunden og forfiner i det stille scoren, hvis de er bedre.
de: Wenn du bereit bist, tippe auf „Messung abrufen“. Die App analysiert deine Daten und findet das beste 5-Minuten-Analysefenster. Der vollständige Erholungsbericht öffnet sich automatisch, sobald die Analyse abgeschlossen ist — kein weiteres Tippen nötig. Mit einem H10 werden die Gerätedaten im Hintergrund hochgeladen und verfeinern den Wert unauffällig, wenn sie besser sind.
es: Cuando estés listo, toca Obtener lectura. La app analiza tus datos y encuentra la mejor ventana de análisis de 5 minutos. El Informe de recuperación completo se abre automáticamente al terminar el análisis, sin tener que tocar nada más. Si usas un H10, los datos del dispositivo se suben en segundo plano y afinan la puntuación sin avisar si es mejor.
fi: Kun olet valmis, napauta Tee mittaus. Sovellus analysoi tietosi ja etsii parhaan 5 minuutin analyysi-ikkunan. Koko Palautumisraportti avautuu automaattisesti, kun analyysi on valmis — lisänapautusta ei tarvita. Jos käytät H10:tä, laitteen tiedot ladataan taustalla ja ne tarkentavat pisteitä huomaamatta, jos ne ovat parempia.
fr: Quand vous êtes prêt, touchez Obtenir la lecture. L’app analyse vos données et trouve la meilleure fenêtre d’analyse de 5 minutes. Le rapport de récupération complet s’ouvre automatiquement à la fin de l’analyse — aucun toucher supplémentaire nécessaire. Avec un H10, les données de l’appareil sont téléversées en arrière-plan et affinent discrètement le score si elles sont meilleures.
is: Þegar þú ert tilbúin/n skaltu ýta á Sækja mælingu. Appið greinir gögnin og finnur besta 5 mínútna greiningargluggann. Öll Bataskýrslan opnast sjálfkrafa þegar greiningu lýkur — engin aukasnerting nauðsynleg. Ef þú notar H10 er gögnum tækisins hlaðið upp í bakgrunni og þau fínstilla stigin hljóðlega ef þau eru betri.
it: Quando sei pronto, tocca Ottieni lettura. L'app analizza i tuoi dati e trova la migliore finestra di analisi di 5 minuti. Il Rapporto di recupero completo si apre automaticamente al termine dell'analisi, senza altri tocchi. Se usi un H10, i dati del dispositivo vengono caricati in background e affinano silenziosamente il punteggio se sono migliori.
ja: 準備ができたら、「測定結果を取得」をタップします。アプリがデータを分析し、最適な 5 分間の分析ウィンドウを見つけます。分析が完了すると、回復レポート全体が自動で開きます — 追加のタップは不要です。H10 を使っている場合は、デバイスのデータがバックグラウンドでアップロードされ、より良い結果が得られればスコアが自動的に更新されます。
ko: 준비가 되면 측정값 가져오기를 탭하세요. 앱이 데이터를 분석해 최적의 5분 분석 구간을 찾습니다. 분석이 끝나면 전체 회복 리포트가 자동으로 열립니다 — 따로 탭할 필요가 없습니다. H10을 사용 중이면 기기 데이터가 백그라운드에서 업로드되고, 더 나은 결과라면 점수를 조용히 다듬습니다.
nb: Når du er klar, trykker du Få måling. Appen analyserer dataene dine og finner det beste analysevinduet på 5 minutter. Hele restitusjonsrapporten åpnes automatisk når analysen er ferdig — du trenger ikke trykke noe mer. Hvis du bruker H10, lastes enhetsdataene opp i bakgrunnen og forbedrer scoren i stillhet hvis de er bedre.
nl: Tik als je klaar bent op Meting ophalen. De app analyseert je gegevens en zoekt het beste analysevenster van 5 minuten. Het volledige herstelrapport opent automatisch zodra de analyse klaar is — geen extra tik nodig. Gebruik je een H10, dan worden de gegevens van het apparaat op de achtergrond geüpload en verfijnen ze ongemerkt de score als die beter is.
pt_br: Quando estiver pronto, toque em Obter leitura. O app analisa seus dados e encontra a melhor janela de análise de 5 minutos. O Relatório de Recuperação completo abre automaticamente quando a análise termina — sem toque extra. Se você usa um H10, os dados do dispositivo são enviados em segundo plano e refinam a pontuação silenciosamente, se forem melhores.
ru: Когда будете готовы, нажмите «Получить результат». Приложение проанализирует данные и найдёт лучшее 5-минутное окно анализа. Полный отчёт о восстановлении откроется автоматически после завершения анализа — дополнительно нажимать ничего не нужно. При использовании H10 данные с устройства загружаются в фоне и незаметно уточняют оценку, если она получается лучше.
sv: När du är redo, tryck på Hämta mätning. Appen analyserar dina data och hittar det bästa 5-minutersfönstret för analys. Hela återhämtningsrapporten öppnas automatiskt när analysen är klar — inget extra tryck behövs. Med en H10 laddas enhetens data upp i bakgrunden och förfinar i det tysta poängen om den blir bättre.
zh_hans: 准备好后，点按“获取读数”。应用会分析你的数据，并找出最佳的 5 分钟分析窗口。分析完成后，完整的恢复报告会自动打开 — 无需额外点按。如果使用 H10，设备数据会在后台上传，如果结果更好，会悄悄优化评分。

source: When you've exercised today, a horizontal zone bar appears below the recovery ring showing your training readiness: Rest, Fatigued, Moderate, or Ready. This combines your recovery score with your current training load to answer the practical question: should I train hard today?
ar: عندما تكون قد تمرّنت اليوم، يظهر شريط مناطق أفقي أسفل حلقة التعافي يعرض جاهزيتك للتدريب: راحة، أو مُرهَق، أو متوسط، أو جاهز. يجمع هذا درجة تعافيك مع حمل تدريبك الحالي للإجابة عن السؤال العملي: هل أتدرب بشدة اليوم؟
da: Når du har trænet i dag, vises en vandret zonebjælke under restitutionsringen med din træningsparathed: Hvile, Udmattet, Moderat eller Klar. Den kombinerer din restitutionsscore med din aktuelle træningsbelastning for at besvare det praktiske spørgsmål: skal jeg træne hårdt i dag?
de: Wenn du heute trainiert hast, erscheint unter dem Erholungsring ein horizontaler Zonenbalken mit deiner Trainingsbereitschaft: Ruhe, Erschöpft, Moderat oder Bereit. Er kombiniert deinen Erholungswert mit deiner aktuellen Trainingsbelastung, um die praktische Frage zu beantworten: Sollte ich heute hart trainieren?
es: Si has hecho ejercicio hoy, aparece bajo el anillo de recuperación una barra horizontal de zonas que muestra tu preparación para entrenar: Descanso, Fatigado, Moderado o Listo. Combina tu puntuación de recuperación con tu carga de entrenamiento actual para responder a la pregunta práctica: ¿debería entrenar fuerte hoy?
fi: Kun olet harjoitellut tänään, palautumisrenkaan alle ilmestyy vaakasuora aluepalkki, joka näyttää harjoitusvalmiutesi: Lepo, Väsynyt, Kohtalainen tai Valmis. Se yhdistää palautumispistemääräsi nykyiseen harjoituskuormitukseesi vastatakseen käytännön kysymykseen: pitäisikö minun treenata tänään kovaa?
fr: Si vous vous êtes entraîné aujourd’hui, une barre de zone horizontale apparaît sous l’anneau de récupération et indique votre préparation à l’entraînement : Repos, Fatigué, Modéré ou Prêt. Elle combine votre score de récupération avec votre charge d’entraînement actuelle pour répondre à la question pratique : dois-je m’entraîner dur aujourd’hui ?
is: Þegar þú hefur æft í dag birtist lárétt svæðastika fyrir neðan batahringinn sem sýnir æfingaviðbúnað þinn: Hvíld, Þreyttur, Hóflegt eða Tilbúið. Hún sameinar batastigið og núverandi æfingaálag til að svara hagnýtu spurningunni: ætti ég að æfa stíft í dag?
it: Quando oggi ti sei allenato, sotto l'anello del recupero compare una barra orizzontale a zone che mostra la tua prontezza all'allenamento: Riposo, Affaticato, Moderato o Pronto. Combina il punteggio di recupero con il carico di allenamento attuale per rispondere alla domanda pratica: dovrei allenarmi duro oggi?
ja: 今日運動した場合、回復リングの下に横方向のゾーンバーが表示され、トレーニングの準備状態（休息、疲労、普通、準備完了）を示します。回復スコアと現在のトレーニング負荷を組み合わせて、「今日はハードに練習すべきか？」という実際的な問いに答えます。
ko: 오늘 운동을 했다면 회복 링 아래에 훈련 준비 상태를 보여 주는 가로 구간 막대가 나타납니다: 휴식, 피로, 보통, 준비 완료. 회복 점수와 현재 훈련 부하를 결합해 실질적인 질문 — 오늘 강하게 훈련해도 될까? — 에 답합니다.
nb: Når du har trent i dag, vises en vannrett sonelinje under restitusjonsringen som viser treningsberedskapen din: Hvile, Utmattet, Moderat eller Klar. Den kombinerer restitusjonsscoren med den nåværende treningsbelastningen for å svare på det praktiske spørsmålet: bør jeg trene hardt i dag?
nl: Als je vandaag hebt getraind, verschijnt onder de herstelring een horizontale zonebalk met je trainingsgereedheid: Rust, Vermoeid, Matig of Gereed. Die combineert je herstelscore met je huidige trainingsbelasting om de praktische vraag te beantwoorden: moet ik vandaag hard trainen?
pt_br: Quando você se exercitou hoje, uma barra de zona horizontal aparece abaixo do anel de recuperação mostrando sua prontidão para treinar: Descanso, Fatigado, Moderado ou Pronto. Ela combina sua pontuação de recuperação com sua carga de treino atual para responder à pergunta prática: devo treinar forte hoje?
ru: Если сегодня была нагрузка, под кольцом восстановления появляется горизонтальная полоса зон, показывающая готовность к тренировке: Отдых, Утомление, Умеренно или Готов. Она объединяет оценку восстановления с текущей тренировочной нагрузкой, чтобы ответить на практический вопрос: стоит ли сегодня тренироваться интенсивно?
sv: När du har tränat idag visas en vågrät zonstapel under återhämtningsringen med din träningsberedskap: Vila, Utmattad, Måttlig eller Redo. Den kombinerar din återhämtningspoäng med din nuvarande träningsbelastning för att besvara den praktiska frågan: ska jag träna hårt idag?
zh_hans: 当你今天运动过时，恢复圆环下方会出现一条水平区间条，显示你的训练准备状态：休息、疲劳、中等或就绪。它将恢复评分与当前训练负荷结合起来，回答一个实际问题：我今天应该高强度训练吗？

source: When your watch provides sleep stage data, the app uses an enhanced six-factor formula:
ar: عندما توفّر ساعتك بيانات مراحل النوم، يستخدم التطبيق صيغة محسّنة من ستة عوامل:
da: Når dit ur leverer data om søvnstadier, bruger appen en udvidet formel med seks faktorer:
de: Wenn deine Watch Daten zu Schlafphasen liefert, verwendet die App eine erweiterte Formel mit sechs Faktoren:
es: Cuando tu reloj aporta datos de fases del sueño, la app usa una fórmula mejorada de seis factores:
fi: Kun kellosi tarjoaa univaihetietoja, sovellus käyttää tehostettua kuuden tekijän kaavaa:
fr: Quand votre montre fournit des données de phases de sommeil, l’app utilise une formule améliorée à six facteurs :
is: Þegar úrið þitt skilar gögnum um svefnstig notar appið bætta sex þátta formúlu:
it: Quando l'orologio fornisce dati sulle fasi del sonno, l'app usa una formula avanzata a sei fattori:
ja: Watch が睡眠段階のデータを提供する場合、アプリは強化された 6 要素の計算式を使います：
ko: 워치가 수면 단계 데이터를 제공하면 앱은 강화된 6요인 공식을 사용합니다:
nb: Når klokken leverer data om søvnstadier, bruker appen en utvidet formel med seks faktorer:
nl: Als je horloge gegevens over slaapstadia levert, gebruikt de app een uitgebreide formule met zes factoren:
pt_br: Quando seu relógio fornece dados de estágios do sono, o app usa uma fórmula aprimorada de seis fatores:
ru: Когда часы предоставляют данные о стадиях сна, приложение использует расширенную формулу из шести факторов:
sv: När din klocka ger data om sömnstadier använder appen en utökad formel med sex faktorer:
zh_hans: 当你的手表提供睡眠阶段数据时，应用会使用增强的六因子公式：

source: Where ACWR does and doesn't act: it does NOT feed your Recovery Score — that score is physiology only. It DOES apply a small damper to Training Readiness above 1.3, on the general principle that the body absorbs gradual change better than abrupt change. That damper is heavily restrained: it scales down when your chronic load is too low for the ratio to be stable, and is capped near zero on mornings when your recovery score already says you're recovered. Your own physiology outranks the bookkeeping when the two disagree.
ar: أين يؤثر ACWR وأين لا يؤثر: لا يغذّي درجة التعافي — فتلك النتيجة فسيولوجية بحتة. لكنه يطبّق مُخمِّدًا صغيرًا على الجاهزية للتدريب فوق 1.3، استنادًا إلى المبدأ العام بأن الجسم يستوعب التغيير التدريجي أفضل من المفاجئ. وهذا المُخمِّد مقيَّد بشدة: يتقلّص عندما يكون حملك المزمن أقل من أن تكون النسبة مستقرة، ويُحدّ قرب الصفر في الصباحات التي تقول فيها درجة تعافيك إنك متعافٍ أصلًا. فسيولوجيتك تتقدّم على الحسابات عندما يختلفان.
da: Hvor ACWR virker, og hvor den ikke gør: den indgår IKKE i din restitutionsscore — den score er udelukkende fysiologi. Den lægger DOG en lille dæmper på Træningsparathed over 1,3 ud fra det generelle princip, at kroppen optager gradvise ændringer bedre end bratte. Den dæmper er stærkt begrænset: den skaleres ned, når din kroniske belastning er for lav til, at forholdet er stabilt, og er begrænset til næsten nul på morgener, hvor din restitutionsscore allerede siger, at du er restitueret. Din egen fysiologi vejer tungere end regnskabet, når de to er uenige.
de: Wo ACWR wirkt und wo nicht: Es fließt NICHT in deinen Erholungs-Score ein — dieser Wert beruht allein auf der Physiologie. Es dämpft jedoch die Trainingsbereitschaft oberhalb von 1,3 leicht, nach dem allgemeinen Prinzip, dass der Körper allmähliche Veränderungen besser verkraftet als abrupte. Diese Dämpfung ist stark begrenzt: Sie wird schwächer, wenn deine chronische Belastung zu niedrig für ein stabiles Verhältnis ist, und ist an Morgen, an denen dein Erholungswert bereits sagt, dass du erholt bist, nahe null gedeckelt. Deine eigene Physiologie hat Vorrang vor der Buchführung, wenn beide sich widersprechen.
es: Dónde actúa el ACWR y dónde no: NO alimenta tu puntuación de recuperación, que es solo fisiología. SÍ aplica un pequeño amortiguador a la preparación para entrenar por encima de 1,3, según el principio general de que el cuerpo asimila mejor los cambios graduales que los bruscos. Ese amortiguador está muy contenido: se reduce cuando tu carga crónica es demasiado baja para que la relación sea estable, y queda casi a cero las mañanas en que tu puntuación de recuperación ya indica que estás recuperado. Tu propia fisiología pesa más que la contabilidad cuando ambas discrepan.
fi: Missä ACWR vaikuttaa ja missä ei: se EI vaikuta palautumispistemäärääsi — se perustuu pelkkään fysiologiaan. Se KYLLÄ hillitsee hieman harjoitusvalmiutta arvon 1,3 yläpuolella sen yleisen periaatteen mukaisesti, että keho sopeutuu asteittaiseen muutokseen paremmin kuin äkilliseen. Tätä hillintää on rajoitettu voimakkaasti: se pienenee, kun krooninen kuormituksesi on liian matala suhteen vakaudelle, ja se on rajattu lähes nollaan aamuina, jolloin palautumispistemääräsi jo kertoo sinun olevan palautunut. Oma fysiologiasi menee kirjanpidon edelle, kun ne ovat eri mieltä.
fr: Là où l’ACWR agit et là où il n’agit pas : il n’alimente PAS votre score de récupération — ce score est purement physiologique. Il applique EN REVANCHE un léger amortissement à la préparation à l’entraînement au-dessus de 1,3, selon le principe général que le corps assimile mieux un changement progressif qu’un changement brusque. Cet amortissement est fortement limité : il diminue quand votre charge chronique est trop basse pour que le ratio soit stable, et il est plafonné près de zéro les matins où votre score de récupération indique déjà que vous êtes récupéré. Votre propre physiologie l’emporte sur la comptabilité quand les deux divergent.
is: Hvar ACWR hefur áhrif og hvar ekki: það hefur EKKI áhrif á batastigið — það stig er eingöngu lífeðlisfræði. Það dregur HINS VEGAR lítillega úr æfingaviðbúnaði yfir 1,3, á þeirri almennu forsendu að líkaminn ráði betur við hægfara breytingar en snöggar. Sú dempun er mjög hófleg: hún minnkar þegar langtímaálag er of lítið til að hlutfallið sé stöðugt, og er nálægt núlli á morgnana þegar batastigið segir þegar að þú hafir jafnað þig. Þín eigin lífeðlisfræði vegur þyngra en bókhaldið þegar þeim ber ekki saman.
it: Dove l'ACWR agisce e dove no: NON entra nel Punteggio di recupero, che è solo fisiologia. Applica INVECE un piccolo freno alla Prontezza all'allenamento sopra 1,3, in base al principio generale che il corpo assorbe meglio i cambiamenti graduali di quelli bruschi. Quel freno è molto contenuto: si riduce quando il carico cronico è troppo basso perché il rapporto sia stabile, ed è limitato quasi a zero nelle mattine in cui il punteggio di recupero dice già che sei recuperato. Quando le due cose non concordano, la tua fisiologia conta più della contabilità.
ja: ACWR が作用するところとしないところ：ACWR は回復スコアには反映されません — そのスコアは生理データのみです。一方、1.3 を超えるとトレーニングの準備状態にわずかな抑制がかかります。体は急な変化よりも緩やかな変化に適応しやすいという一般原則に基づくものです。この抑制は強く制限されています：慢性負荷が低すぎて比率が安定しない場合は小さくなり、回復スコアがすでに回復していると示している朝にはほぼゼロに抑えられます。両者が食い違う場合は、帳簿よりもあなた自身の生理が優先されます。
ko: ACWR이 작용하는 곳과 작용하지 않는 곳: 회복 점수에는 반영되지 않습니다 — 그 점수는 생리 데이터만 사용합니다. 다만 1.3을 넘으면 훈련 준비 상태에 작은 감쇠를 적용합니다. 몸은 급격한 변화보다 점진적인 변화를 더 잘 흡수한다는 일반 원칙에 따른 것입니다. 이 감쇠는 강하게 제한되어 있습니다: 만성 부하가 너무 낮아 비율이 안정적이지 않으면 줄어들고, 회복 점수가 이미 회복되었다고 말하는 아침에는 거의 0으로 제한됩니다. 둘이 일치하지 않으면 장부 계산보다 본인의 생리 상태가 우선합니다.
nb: Hvor ACWR virker og ikke virker: den inngår IKKE i restitusjonsscoren — den scoren er bare fysiologi. Den GIR en liten demping av treningsberedskapen over 1,3, ut fra det generelle prinsippet at kroppen tar opp gradvise endringer bedre enn brå endringer. Dempingen er sterkt begrenset: den skaleres ned når den kroniske belastningen er for lav til at forholdet er stabilt, og er satt nær null på morgener der restitusjonsscoren allerede sier at du er restituert. Din egen fysiologi veier tyngre enn regnskapet når de to er uenige.
nl: Waar ACWR wel en niet meetelt: het telt NIET mee in je herstelscore — die score is alleen fysiologie. Het geeft WEL een kleine demping op de trainingsgereedheid boven 1,3, vanuit het algemene principe dat het lichaam geleidelijke verandering beter verwerkt dan abrupte. Die demping is sterk beperkt: ze wordt kleiner als je chronische belasting te laag is voor een stabiele ratio, en is bijna nul op ochtenden waarop je herstelscore al zegt dat je hersteld bent. Je eigen fysiologie weegt zwaarder dan de boekhouding als die twee het oneens zijn.
pt_br: Onde o ACWR atua e onde não atua: ele NÃO alimenta sua Pontuação de Recuperação — essa pontuação é só fisiologia. Ele APLICA um pequeno amortecimento à Prontidão para treino acima de 1,3, pelo princípio geral de que o corpo absorve melhor mudanças graduais do que bruscas. Esse amortecimento é bastante contido: ele diminui quando sua carga crônica é baixa demais para a razão ser estável e fica limitado a quase zero nas manhãs em que sua pontuação de recuperação já indica que você está recuperado. Sua própria fisiologia prevalece sobre a contabilidade quando as duas discordam.
ru: Где ACWR действует, а где нет: он НЕ входит в оценку восстановления — она основана только на физиологии. Он ДЕЙСТВИТЕЛЬНО немного снижает готовность к тренировке при значениях выше 1,3, исходя из общего принципа, что организм лучше усваивает постепенные изменения, чем резкие. Это снижение сильно ограничено: оно уменьшается, когда хроническая нагрузка слишком мала для стабильного соотношения, и близко к нулю в те утра, когда оценка восстановления уже говорит, что вы восстановились. Ваша собственная физиология важнее учётных цифр, когда они расходятся.
sv: Var ACWR verkar och inte verkar: den påverkar INTE din återhämtningspoäng — den poängen är bara fysiologi. Den GER en liten dämpning av träningsberedskapen över 1,3, utifrån den allmänna principen att kroppen tar upp gradvis förändring bättre än plötslig. Dämpningen är kraftigt begränsad: den minskar när din kroniska belastning är för låg för att kvoten ska vara stabil, och är nästan noll de morgnar då din återhämtningspoäng redan säger att du är återhämtad. Din egen fysiologi väger tyngre än bokföringen när de två inte stämmer överens.
zh_hans: ACWR 在哪里起作用、在哪里不起作用：它不计入你的恢复评分 — 该评分只看生理数据。它会在高于 1.3 时对训练准备状态施加一个小的抑制，依据的一般原则是身体适应渐进变化比适应突变更好。这个抑制受到严格限制：当你的慢性负荷太低、比值不稳定时会缩小，而在恢复评分已经表明你恢复良好的早晨则被限制在接近零。当两者不一致时，你自己的生理数据优先于账面数字。

source: Where It Looks
ar: أين يبحث
da: Hvor den leder
de: Wo gesucht wird
es: Dónde busca
fi: Mistä se etsii
fr: Où elle cherche
is: Hvar hún leitar
it: Dove cerca
ja: 探索する範囲
ko: 찾는 위치
nb: Hvor den leter
nl: Waar het zoekt
pt_br: Onde ele procura
ru: Где он ищет
sv: Var den letar
zh_hans: 它在哪里寻找

source: Where Stages Come From
ar: من أين تأتي المراحل
da: Hvor stadierne kommer fra
de: Woher die Phasen stammen
es: De dónde vienen las fases
fi: Mistä univaiheet tulevat
fr: D’où viennent les phases
is: Hvaðan svefnstigin koma
it: Da dove vengono le fasi
ja: 睡眠段階データの入手元
ko: 수면 단계의 출처
nb: Hvor stadiene kommer fra
nl: Waar stadia vandaan komen
pt_br: De onde vêm os estágios
ru: Откуда берутся стадии
sv: Var stadierna kommer ifrån
zh_hans: 睡眠阶段的来源
